import { Knex } from 'knex';

class ProductReviewsHelper {
    private knex: Knex;

    constructor(knex: Knex) {
        // using dependency injection to inject a Knex instance
        // we can't access "knex" using any other way, because knex is injected into the 'seed' function
        this.knex = knex;
    }

    // returns a random number from min to max (min and max included)
    randomInteger(min: number, max: number): number {
        return Math.floor(min + Math.random() * (max + 1 - min));
    }

    getProductIdByTitleSubquery(title: string) {
        return this.knex('products')
            .select<{ id: number }[]>('id')
            .where({ title });
    }

    async getUniqueUsers(userCount: number): Promise<number[]> {
        const rows = await this.knex('users')
            .select<{ id: number }[]>('id')
            .whereNot({ email: process.env.DB_SEEDING_ADMIN_EMAIL })
            .orderByRaw('RANDOM()')
            .limit(userCount);

        return rows.map((row) => row.id);
    }

    // this function returns a random moderation status (either 'pending' or 'approved' - the 'rejected' status won't be considered)
    // this function is biased towards 'approved'
    getRandomModerationStatusIdSubquery() {
        let chosenStatus: 'pending' | 'approved';
        // 30% chance that 'pending' will be chosen
        if (this.randomInteger(1, 10) >= 8) chosenStatus = 'pending';
        // 70% chance that 'approved' will be chosen
        else chosenStatus = 'approved';

        return this.knex('moderation_statuses')
            .select('id')
            .where({ name: chosenStatus });
    }

    // generates a random date
    // important: this date will be at some point in the past; it cannot be in the future
    getRandomDate() {
        const currentDate = new Date();

        const randomYear: number = this.randomInteger(2023, 2024);
        const isCurrentYear: boolean = randomYear === currentDate.getFullYear();

        const randomMonth: number = isCurrentYear
            ? this.randomInteger(0, currentDate.getMonth())
            : this.randomInteger(0, 11);
        const isCurrentMonth: boolean = randomMonth === currentDate.getMonth();

        return new Date(
            // year
            randomYear,
            // month
            randomMonth,
            // days
            isCurrentYear && isCurrentMonth
                ? this.randomInteger(1, currentDate.getDate() - 1)
                : this.randomInteger(1, 31)
        );
    }
}

const productReviews: {
    [productTitle: string]: { review: string; rating: number }[];
} = {
    'Консоль Sony PlayStation 4 Slim 500GB Black': [
        {
            review: 'Дуже класна якість графіки та швидкість реакції. Граю вже тиждень і не можу нарадітися!',
            rating: 5,
        },
        {
            review: 'Придбали для дітей. Вони просто в захваті від ігор та можливостей. Якість звуку також на висоті.',
            rating: 4.5,
        },
        {
            review: 'Шикарна консоль, але трошки шумна. Це єдиний недолік.',
            rating: 4,
        },
        {
            review: 'Ця консоль відкрила для мене світ геймінгу. Неймовірний досвід і відчуття!',
            rating: 5,
        },
    ],
    'Nintendo Switch OLED Біла': [
        {
            review: 'Просто чудова консоль для ігор у русі. Яскравий екран і величезний вибір ігор.',
            rating: 5,
        },
        {
            review: 'Купили для подорожей, і не пожалкували! Зручно, стильно і завжди є в що пограти.',
            rating: 4.5,
        },
        {
            review: 'Консоль дуже швидко переключається між іграми, дуже неочікуваний сюрприз. OLED екран додатково додає краси',
            rating: 5,
        },
        {
            review: 'Жаль, що немає більше ігор у вільному доступі. Трошки обмежений вибір',
            rating: 3.5,
        },
    ],
    'PlayStation 5 Ultra HD Blu-ray Call of Duty: Modern Warfare III': [
        {
            review: 'PS5 - це просто машина майбутнього! Графіка в Call of Duty просто божественна. Враження дуже гарні!',
            rating: 5,
        },
        {
            review: 'Консоль купувалася спеціально для Call of Duty, ні про що не шкодую. Заглибився в гру як ніколи раніше.',
            rating: 4.5,
        },
        {
            review: "Величезний об'єм пам'яті, швидкість завантаження, ігри виглядають неймовірно. Просто космос!",
            rating: 5,
        },
        {
            review: 'На жаль, деякі ігри ще не адаптувались до можливостей консолі, але загалом консоль бомбезна.',
            rating: 4,
        },
    ],
    'Консоль Microsoft Xbox Series X 1TB Black': [
        {
            review: 'Xbox Series X - це справжня потужність. Графіка, швидкість, управління - все на висоті.',
            rating: 5,
        },
        {
            review: 'Зручний геймпад, швидкість реакції - все, що потрібно для геймера.',
            rating: 4.5,
        },
        {
            review: 'Тут нічого казати - просто маст хев!',
            rating: 5,
        },
        {
            review: 'Шкода, що важкий, але функціонал виправдовує вагу. Отримав задоволення від гри!',
            rating: 4,
        },
    ],
    'Sony PlayStation 5 Digital Edition 825GB White': [
        {
            review: 'Цифрова версія - це майбутнє геймінгу. Зберігає багато місця, і завжди можна скачати щось нове.',
            rating: 5,
        },
        {
            review: 'Білий колір виглядає стильно. Проста у використанні та ефективна.',
            rating: 4.5,
        },
        {
            review: 'Доступніше рішення, якщо не потрібен Blu-ray. Швидкість завантаження - дивовижна.',
            rating: 4,
        },
        {
            review: 'Жаль, що без дисководу. Але для тих, хто любить цифровий контент - ідеальний вибір.',
            rating: 4,
        },
    ],
    'Apple MacBook Pro 16" M1 Pro 512GB 2021': [
        {
            review: 'Макбук - це просто шедевр технології. Швидкий, потужний, екран вражає!',
            rating: 5,
        },
        {
            review: 'Роблю на ньому важкі обчислення, і він справляється на відмінно.',
            rating: 5,
        },
        {
            review: 'Ноутбук прикольний, але є відчуття, що половина ціни - це чисто бренд',
            rating: 4,
        },
        {
            review: 'Для роботи з мультимедіа - просто знахідка. Графіка, звук - все на високому рівні.',
            rating: 4.5,
        },
    ],
    'Ноутбук Acer Aspire 7 A715-42G-R5B1': [
        {
            review: 'Це найкращий варіант для геймерів з обмеженим бюджетом. Не завжди тягне на ультра налаштуваннях, але мене все влаштовує',
            rating: 4.5,
        },
        {
            review: 'Для роботи та навчання - ідеальний вибір. Зручний, легкий, але продуктивний.',
            rating: 5,
        },
        {
            review: 'Довго хотілось хороший ноутбук за доступну ціну. Цей ноут - відмінний баланс.',
            rating: 4,
        },
        {
            review: 'Акумулятор занадто слабкий. Потрібно часто підзаряджати. Все інше наче норм',
            rating: 3.5,
        },
    ],
    'Ноутбук ASUS Laptop X515MA-BR874W Transparent Silver': [
        {
            review: 'Економічний варіант для повсякденних завдань. Не найшвидший, але надійний.',
            rating: 4,
        },
        {
            review: 'Для студентів - просто знахідка. Зручний, легкий, вистачає для навчання.',
            rating: 4.5,
        },
        {
            review: 'Неочікувано добрий звук для такого ноутбука. Для навчання підходить, але екран не дуже',
            rating: 4,
        },
        {
            review: 'Можна було б додати трошки потужності. Для важких завдань трошки повільний.',
            rating: 3.5,
        },
    ],
    'Ноутбук Acer Nitro 5 AN515-58-539L Obsidian Black': [
        {
            review: 'Геймерський ноутбук за прийнятну ціну. Все летить на максимальних налаштуваннях.',
            rating: 5,
        },
        {
            review: 'Зручна клавіатура, яка освітлюється. Виглядає стильно, ігри теж йдуть на ура. ',
            rating: 4.5,
        },
        {
            review: 'Швидкий, прохолодний, ігри не гальмують. Гарний ноут',
            rating: 5,
        },
        {
            review: 'Потужний, але гучний вентилятор. На довгий термін роботи може втомити.',
            rating: 4,
        },
    ],
    'Ноутбук ASUS TUF Gaming A15 (2022)': [
        {
            review: 'Ідеальний для геймінгу та роботи. Очікування виправдалися.',
            rating: 5,
        },
        {
            review: 'Багато портів для підключення. Зручний для роботи з периферією.',
            rating: 4.5,
        },
        {
            review: 'Продуманий дизайн та непогана вага для геймерського ноутбука.',
            rating: 5,
        },
        {
            review: 'Акумулятор тримає не так довго, як хотілося б. Часто потрібно підзаряджати.',
            rating: 4,
        },
    ],
    "Комп'ютер ARTLINE Gaming ASUS Edition X43 (X43v33) Ryzen 5 3600/RAM 16ГБ/HDD 1ТБ + SSD 240ГБ/GeForce RTX 3050 8ГБ/Wi-Fi":
        [
            {
                review: 'Збалансована конфігурація, графіка вражає. Не жалкую про покупку',
                rating: 5,
            },
            {
                review: 'Швидкий SSD диск робить роботу із завантаженням швидкою та приємною.',
                rating: 4.5,
            },
            {
                review: 'Начинка непогана, але блок живлення можна було кращий покласти.',
                rating: 3.5,
            },
            {
                review: 'Шумний вентилятор може дратувати, але це ціна за високу продуктивність.',
                rating: 4,
            },
        ],
    "Комп'ютер ARTLINE Gaming D31WHITE": [
        {
            review: 'Білий дизайн виглядає стильно. Продуктивність на високому рівні.',
            rating: 5,
        },
        {
            review: 'Гарна графіка та низький рівень шуму роблять його ідеальним для геймінгу.',
            rating: 5,
        },
        {
            review: "бірка комп'ютера - на висоті. Жодних проблем з роботою.",
            rating: 5,
        },
        {
            review: "Можливостей для розширення комп'ютера більше не вистачає.",
            rating: 4,
        },
    ],
    "Комп'ютер Cobra Advanced I14F.16.H1S4.166S.6368": [
        {
            review: 'Швидкий, тихий і зручний в роботі. Все, що треба для геймінгу та роботи',
            rating: 5,
        },
        {
            review: 'Непогана продуктивність за доступну ціну. Вдячний за такий варіант.',
            rating: 5,
        },
        {
            review: 'Вибір виявився вдалим. Для моїх задач вистачає',
            rating: 4.5,
        },
        {
            review: 'Жодних нарікань, окрім ваги. Досить важкий для переноски.',
            rating: 4,
        },
    ],
    "Комп'ютер ARTLINE Gaming X49": [
        {
            review: 'Топова продуктивність за адекватну ціну. Всі ігри працюють на вищому рівні.',
            rating: 5,
        },
        {
            review: 'Блок живлення перестав працювати через півроку. Дуже прикро(',
            rating: 1,
        },
        {
            review: 'Гарна якість відображення гри на моніторі. Ідеально для стрімінгу.',
            rating: 5,
        },
        {
            review: 'Гучний вентилятор може вам завадити при тривалому користуванні.',
            rating: 3.5,
        },
    ],
    "Комп'ютер Lenovo IdeaCentre G5 Gaming 14IOB6": [
        {
            review: 'Компактний і продуктивний. Графіка вражає. Lenovo вразила якістю.',
            rating: 5,
        },
        {
            review: 'Підходить для тих, хто не любить великі системні блоки. Зручно розташовується, але трохи слабкий за таку ціну',
            rating: 4.5,
        },
        {
            review: "Швидкий і надійний комп'ютер. Очікування виправдалися.",
            rating: 5,
        },
        {
            review: 'Дуже гучний при великому завантаженні. Але загалом непоганий варіант',
            rating: 4,
        },
    ],
    'Samsung Galaxy Tab S7 FE 12.4" 4/64GB Wi-Fi Black': [
        {
            review: 'Легкий та тонкий, зручно носити з собою. Ідеально для перегляду контенту.',
            rating: 5,
        },
        {
            review: 'Можливості для мультимедіа на високому рівні. Гарний звук та яскравий дисплей.',
            rating: 4.5,
        },
        {
            review: 'Цікавий дизайн, але трошки дорогий. За ці гроші можна знайти інші опції.',
            rating: 5,
        },
        {
            review: 'Планшет вражає якістю екрану та продуктивністю. Відмінно підходить для роботи.',
            rating: 4,
        },
    ],
    'Samsung Galaxy Tab A7 Lite Wi-Fi 32GB Grey': [
        {
            review: 'Легкий і компактний. Достатньо потужний для повсякденних завдань.',
            rating: 4,
        },
        {
            review: 'Досить приємний за ціну. Для читання і перегляду відео - саме те.',
            rating: 4.5,
        },
        {
            review: 'Економічний вибір, але екран занадто яскравий',
            rating: 3.5,
        },
        {
            review: 'Бюджетний варіант, але виконує свої функції на відмінно.',
            rating: 5,
        },
    ],
    'Планшет Apple iPad 10.2" 2021 Wi-Fi 64 GB Silver': [
        {
            review: 'Якість зображення та продуктивність на вищому рівні. Вартість виправдовується.',
            rating: 5,
        },
        {
            review: 'iPad завжди на висоті. Відмінно працює з іншими пристроями Apple.',
            rating: 4.5,
        },
        {
            review: 'Екосистема Apple робить його найкращим вибором для власників iPhone та MacBook.',
            rating: 5,
        },
        {
            review: 'Дорогий, але якість вражає. Великий екран і продуктивність.',
            rating: 4,
        },
    ],
    'Планшет Oscal Pad 13 8/256GB LTE Space Grey': [
        {
            review: "Вражаюча продуктивність і великий обсяг пам'яті. Ідеально для роботи в дорозі.",
            rating: 5,
        },
        {
            review: 'LTE забезпечує швидкий інтернет навіть поза домом. Дуже зручно.',
            rating: 4.5,
        },
        {
            review: 'Досить потужний, але дизайн може бути кращим.',
            rating: 4,
        },
        {
            review: "Екран трошки відбиває світло, що може розчаровувати у деяких умовах освітлення. І досить важко його підключати до комп'ютера з Windows",
            rating: 3.5,
        },
    ],
    'Планшет Samsung Galaxy Tab S9 FE Wi-Fi 6/128GB Silver': [
        {
            review: 'Гарний дизайн та потужна продуктивність. Оновлений стилус - крута річ.',
            rating: 5,
        },
        {
            review: 'еликий екран і тривалий час роботи на одному заряді. Очікування виправдалися.',
            rating: 5,
        },
        {
            review: 'Samsung знову на висоті. Підходить для роботи та розваг.',
            rating: 5,
        },
        {
            review: 'Не дуже легкий, але функціонал виправдовує вагу.',
            rating: 4,
        },
    ],
    'Motorola G32 6/128GB Grey': [
        {
            review: 'Бюджетний варіант з хорошою продуктивністю. Зйомка дійсно вражає',
            rating: 4.5,
        },
        {
            review: 'Android без надмірностей. Хороший вибір за свою ціну.',
            rating: 4,
        },
        {
            review: 'Екран може бути надто яскравим, але для щоденного використання вистачає.',
            rating: 4.5,
        },
        {
            review: 'Батарея тримає довго. Відмінний вибір для тих, хто не любить дорогі смартфони.',
            rating: 5,
        },
    ],
    'Мобільний телефон Samsung Galaxy A24 6/128GB Black': [
        {
            review: 'Чудовий апарат, не поступається якістю. Камера прикольна',
            rating: 5,
        },
        {
            review: 'Прикольненький, але сильний оверпрайс',
            rating: 3,
        },
        {
            review: 'Samsung знову довів, що може виготовляти якісні смартфони за доступною ціною.',
            rating: 5,
        },
        {
            review: 'Android One забезпечує швидкі оновлення та чистий Android.',
            rating: 5,
        },
    ],
    'Мобільний телефон Apple iPhone 15 128GB Pink': [
        {
            review: 'iOS - найзручніша операційна система. Камера суперова',
            rating: 5,
        },
        {
            review: 'Новий iPhone завжди вражає якістю зйомки і роботи. Вартість оправдована.',
            rating: 5,
        },
        {
            review: 'Мало чим відрізняється від попереднього айфону',
            rating: 3,
        },
        {
            review: 'Вартість може бути вище середньої, але якість - на висоті.',
            rating: 5,
        },
    ],
    'Мобільний телефон Apple iPhone 12 128GB Purple': [
        {
            review: 'Класика від Apple. Зручний та функціональний',
            rating: 5,
        },
        {
            review: 'Стійкий до води і пилу - великий плюс для активних користувачів.',
            rating: 5,
        },
        {
            review: "Плавна робота, чудова камера, великий обсяг пам'яті.",
            rating: 5,
        },
        {
            review: 'Мені трошки великий, але це питання звички. Загалом, рекомендую',
            rating: 4.5,
        },
    ],
    'Мобільний телефон Honor Magic5 Lite 5G 8/256GB Midnight Black': [
        {
            review: 'Камера може бути трошки кращою, але за ці гроші - прекрасний вибір.',
            rating: 4,
        },
        {
            review: 'Потужний смартфон. Шкода тільки, що в Україні ще немає 5G, хотілось би потестити на цьому смартфоні',
            rating: 5,
        },
        {
            review: 'Ідеальний баланс ціни і характеристик.',
            rating: 5,
        },
        {
            review: 'Зручний і стильний. Досить потужний для щоденного використання',
            rating: 5,
        },
    ],
    'Жорсткий диск Seagate Basic 2TB 2.5 USB 3.0 External Gray': [
        {
            review: 'Невеликий та потужний. Зручно брати з собою в поїздки.',
            rating: 5,
        },
        {
            review: 'Працює тихо і ефективно. Досить компактний для стільниці. Трохи повільний, як на мене, але мені цієї швидкості вистачає',
            rating: 4,
        },
        {
            review: 'Простий у використанні, працює без нарікань',
            rating: 5,
        },
        {
            review: 'Ідеальний для зберігання великої кількості фотографій та відео.',
            rating: 5,
        },
    ],
    'Жорсткий диск Transcend StoreJet 25M3C 4 TB TS4TSJ25M3C 2.5" USB 3.1 Type-C External':
        [
            {
                review: "Великий обсяг пам'яті, надійний корпус. Ідеальний для резервного копіювання.",
                rating: 5,
            },
            {
                review: 'Дуже радів коли купив, але через 2 тижні перестав працювати, скоріше за все брак. Дуже неприємно',
                rating: 1,
            },
            {
                review: 'Мій постійний супутник в подорожах. Надійний і зручний.',
                rating: 5,
            },
            {
                review: 'Завдяки Type-C легко підключити до сучасних гаджетів. Працює без збоїв.',
                rating: 5,
            },
        ],
    'Western Digital Blue 1TB 7200rpm 64MB': [
        {
            review: 'Надійний та швидкий HDD для зберігання великої кількості даних.',
            rating: 5,
        },
        {
            review: 'Чудовий вибір для зберігання фотографій та відео. Тихий і ефективний.',
            rating: 4.5,
        },
        {
            review: 'Підійде для ігор та мультимедіа. Якість від WD на високому рівні.',
            rating: 5,
        },
        {
            review: 'Уже не перший диск від WD. Усі працюють до цього дня',
            rating: 5,
        },
    ],
    'Жорсткий диск Seagate SkyHawk HDD 1TB 5900rpm 64MB ST1000VX005 3.5 SATAIII':
        [
            {
                review: 'Підходить для систем відеоспостереження. Надійний і стабільний.',
                rating: 4.5,
            },
            {
                review: "Багато пам'яті за доступну ціну. Використовую для зберігання великої музичної колекції.",
                rating: 5,
            },
            {
                review: 'Чудовий вибір для тих, хто шукає недорогий, але якісний HDD. Є певні недоліки, але за таку ціну готовий їх пробачити',
                rating: 4,
            },
            {
                review: 'Тихий і надійний. Рекомендую для тих, хто цінує якість',
                rating: 4.5,
            },
        ],
    'Жорсткий диск Western Digital Gold 2TB 7200rpm 128MB WD2005FBYZ 3.5" SATA III':
        [
            {
                review: 'WD завжди на висоті. Цей HDD - надійний облік для великих обсягів даних.',
                rating: 5,
            },
            {
                review: 'Працює бездоганно, швидко і стабільно. Велика ємність - великий плюс.',
                rating: 5,
            },
            {
                review: 'Надійний друг для зберігання критичних даних. Дуже сподобався',
                rating: 5,
            },
            {
                review: 'Завдяки великому буферу і швидкістю обробки даних відмінно впорається з будь-яким завданням.',
                rating: 4.5,
            },
        ],
    'SSD диск Kingston A400 480GB 2.5" SATAIII 3D V-NAND (SA400S37/480G)': [
        {
            review: 'Значно прискорив роботу мого старенького ноутбука. Вражений швидкістю.',
            rating: 5,
        },
        {
            review: 'Ціна-якість - ідеальний баланс. Рекомендую для оновлення ПК.',
            rating: 4.5,
        },
        {
            review: "Великий обсяг пам'яті за доступну ціну. Швидкість передачі даних - на висоті.",
            rating: 5,
        },
        {
            review: 'Надійний і досить швидкий SSD для підвищення продуктивності системи.',
            rating: 4,
        },
    ],
    'SSD диск Kingston NV2 1TB M.2 2280 NVMe PCIe 4.0 x4 (SNV2S/1000G)': [
        {
            review: 'Після SATA 3 - цей ССД просто пушка!',
            rating: 5,
        },
        {
            review: 'Швидкість передачі даних вражає. Ідеальний вибір для ігор і ресурсомістких задач.',
            rating: 5,
        },
        {
            review: "Великий обсяг пам'яті і вражаюча швидкість. Завдяки PCIe 4.0 відчутно швидший за попередні моделі.",
            rating: 5,
        },
        {
            review: 'Kingston вразив якістю свого продукту. Працює бездоганно.',
            rating: 5,
        },
    ],
    'SSD диск Samsung 870 Evo-Series 500GB 2.5" SATA III V-NAND 3bit MLC (TLC)':
        [
            {
                review: 'Samsung завжди на висоті. Швидкість і надійність - ось його відмінні риси.',
                rating: 5,
            },
            {
                review: 'Вражаюча продуктивність за доступну ціну. Покупка вдала вийшла',
                rating: 4.5,
            },
            {
                review: 'Забув, що таке очікувати на завантаження. Ніколи не перейду на HDD після цього ССДшника',
                rating: 5,
            },
            {
                review: 'Додав нового духу старому ноутбуку. Рекомендую купити',
                rating: 4.5,
            },
        ],
    'SSD диск Apacer AS340X 120GB 2.5" SATAIII 3D NAND': [
        {
            review: 'Для операційної системи саме те, що треба. Зручний і ефективний.',
            rating: 4,
        },
        {
            review: 'Невеликий обсяг, але дуже швидкий. Відмінно підійде для швидкості системи.',
            rating: 4.5,
        },
        {
            review: 'Ціна приємно вражає, а продуктивність на високому рівні',
            rating: 4,
        },
        {
            review: 'Недорогий варіант для оновлення старого ПК. Рекомендую.',
            rating: 4.5,
        },
    ],
    'SSD диск Kingston KC3000 1TB M.2 2280 NVMe PCIe Gen 4.0 x4 3D TLC NAND (SKC3000S/1024G)':
        [
            {
                review: 'Очікування виправдані! Швидкість у 2 рази вища за попередні моделі. Рекомендую для геймерів.',
                rating: 4.5,
            },
            {
                review: 'Поглибився в іграх майже без збоїв та зависань. Ціна виправдовує якість.',
                rating: 4,
            },
            {
                review: 'Непогана швидкість, але вартість занадто висока.',
                rating: 4,
            },
            {
                review: 'SSD на високому рівні. Але здається, що ціна за бренд.',
                rating: 4,
            },
        ],
    'Процесор AMD Ryzen 5 4600G 3.7GHz/8MB (100-100000147BOX) sAM4 BOX': [
        {
            review: 'AMD завжди вражає своєю продуктивністю. Для ігор і ресурсомістких завдань - ідеальний.',
            rating: 5,
        },
        {
            review: 'Бездоганна робота в будь-якому режимі. Ціна-якість - просто вражаюча.',
            rating: 4.5,
        },
        {
            review: 'Висока продуктивність за прийнятну ціну. Збільшила швидкість роботи ПК.',
            rating: 5,
        },
        {
            review: 'Швидкий і потужний, але сильно гріється. Треба хороший кулер для нього',
            rating: 5,
        },
    ],
    'Процесор Intel Core i9-13900KF 3.0GHz/36MB (BX8071513900KF) s1700 BOX': [
        {
            review: 'Бомбезний процесор, але навіть не думайте брати повітряне охолодження!!!! Не повторюйте мою помилку, беріть водянку одразу, бо цього монстра треба гарно охолоджувати',
            rating: 4.5,
        },
        {
            review: 'Процесор майбутнього. Вражаюча швидкість і надійність.',
            rating: 5,
        },
        {
            review: 'Ідеальний для геймерів і відеомонтажу. Топова продуктивність.',
            rating: 5,
        },
        {
            review: 'Ціна дещо висока, але продуктивність вражає.',
            rating: 4,
        },
    ],
    'Процесор Intel Core i5-14600KF 4.0GHz/24MB (BX8071514600KF) s1700 BOX': [
        {
            review: 'Швидкість роботи на висоті. Ідеально для ігор і ресурсомістких завдань',
            rating: 5,
        },
        {
            review: 'Процесор від Intel - завжди ознака якості. Рекомендую для багатозадачності.',
            rating: 4.5,
        },
        {
            review: 'Цікавий варіант для середньобюджетних систем. Збалансована продуктивність.',
            rating: 4,
        },
        {
            review: 'Гарна заміна для Ryzen 5 1200. Ігровий ПК тепер працює бездоганно.',
            rating: 5,
        },
    ],
    'Процесор Intel Core i3-10100F 3.6 GHz / 6 MB (BX8070110100F) s1200 BOX': [
        {
            review: 'Бюджетний варіант, але дуже добре впорався з щоденними завданнями. Ціна-якість',
            rating: 5,
        },
        {
            review: 'За таку ціну просто чудово. Не для геймінгу, але для офісу - саме те.',
            rating: 4,
        },
        {
            review: 'Недорогий і досить продуктивний процесор для офісного ПК.',
            rating: 4,
        },
        {
            review: 'Задоволений швидкістю роботи, але на важких завданнях тормозить',
            rating: 3.5,
        },
    ],
    'Процесор AMD Ryzen 5 3600 3.6 GHz / 32 MB (100-000000031) sAM4 OEM': [
        {
            review: 'Ідеальний вибір для геймерів. Швидкий і потужний.',
            rating: 5,
        },
        {
            review: 'Дуже хороший процесор за свою ціну. Рекомендую для ігор і робочих завдань.',
            rating: 5,
        },
        {
            review: 'AMD завжди на висоті. Топ процесор за свою ціну',
            rating: 5,
        },
        {
            review: 'Не знайшов конкретних недоліків. Все на високому рівні.',
            rating: 5,
        },
    ],
    'Відеокарта Asus PCI-Ex GeForce RTX 3060 Dual OC V2 LHR 12GB GDDR6 (192bit)':
        [
            {
                review: 'Гарна відеокарта за свою ціну. Рейтресинг взагалі топчик',
                rating: 5,
            },
            {
                review: 'Непогана відеокарта, але краще переплатити і взяти AMD RX 6700',
                rating: 4,
            },
            {
                review: 'Для своїх грошей - непоганий вибір.',
                rating: 4,
            },
            {
                review: 'Підійшла для моїх ігор і робочих завдань. Рекомендую.',
                rating: 5,
            },
            {
                review: 'Здох кулер через 2 роки :((',
                rating: 1,
            },
        ],
    'ASUS PCI-Ex GeForce RTX 4070 Ti ROG Strix 12GB GDDR6X (192bit)': [
        {
            review: 'Дорога, але вартує своїх грошей. Графіка дивовижна.',
            rating: 4,
        },
        {
            review: 'Топова відеокарта для геймерів. Все літає',
            rating: 5,
        },
        {
            review: 'Вражаюча продуктивність! Зручний дизайн і тиха робота.',
            rating: 5,
        },
        {
            review: 'Ідеальний вибір для професіоналів. Рекомендую для редагування відео.',
            rating: 5,
        },
    ],
    'Asus PCI-Ex GeForce RTX 2060 Dual EVO OC Edition 6GB GDDR6': [
        {
            review: 'Задоволений продуктивністю. Графіка досить непогана за таку ціну',
            rating: 4.5,
        },
        {
            review: 'Показує зелені полоси коли граю в ігри. Дуже незадоволений',
            rating: 1,
        },
        {
            review: 'Хороший вибір для середньобюджетного ПК',
            rating: 4.5,
        },
        {
            review: 'Супер стильно вигладає, і в іграх себе добре показує',
            rating: 4.5,
        },
    ],
    'Відеокарта ASUS PCI-Ex GeForce RTX 4060 Ti ProArt OC Edition 16GB GDDR6 (128bit)':
        [
            {
                review: 'Для редагування відео - ідеальний варіант. Збалансована продуктивність.',
                rating: 4.5,
            },
            {
                review: 'Гарна відеокарта, але дорога. Працює стабільно як при 3Д-моделюванні, так і в іграх',
                rating: 4,
            },
            {
                review: 'Зручний дизайн і гарна продуктивність. Але вартість перебільшена.',
                rating: 4.5,
            },
            {
                review: 'Хороша відеокарта, але пищать дроселі при навантаженні',
                rating: 4,
            },
        ],
    'Відеокарта Gigabyte PCI-Ex GeForce RTX 4060 Ti Eagle 8GB GDDR6 (128bit)': [
        {
            review: 'Гарна відеокарта за свої гроші. Запускає всі сучасні ігри на високих налаштуваннях.',
            rating: 5,
        },
        {
            review: 'Прийнятна ціна, гарна продуктивність. Для середнього геймера - ідеальний вибір',
            rating: 4,
        },
        {
            review: "Наче нічого, але 8 ГБ відеопам'яті дуже мало за таку ціну, могли б хоча б 12 ГБ додати",
            rating: 4,
        },
        {
            review: 'Не вражає продуктивністю. Чекав більшого за ці гроші.',
            rating: 3,
        },
    ],
    "Оперативна пам'ять Kingston Fury DDR4-3200 16384 MB PC4-25600 (Kit of 2x8192) Beast RGB Black (KF432C16BBAK2/16)":
        [
            {
                review: "RGB підсвітка виглядає дуже стильно. Швидка і надійна пам'ять.",
                rating: 5,
            },
            {
                review: 'Для геймера - ідеальний вибір. Рекомендую всім своїм друзям.',
                rating: 5,
            },
            {
                review: "Дуже задоволений покупкою. Порада: включіть XMP-профіль, якщо БІОС показує частоту пам'яті менше ніж 3200",
                rating: 5,
            },
            {
                review: 'RGB - непогана фішка, але через деяких час вона набридла, а вимкнути її ніяк не можна',
                rating: 4,
            },
        ],
    "Оперативна пам'ять G.Skill DDR4-3600 65536 MB PC4-28800 (Kit of 2x32768) Trident Z Neo (F4-3600C18D-64GTZN)":
        [
            {
                review: 'Після 16 ГБ відчуваю себе як риба у воді. Однозначно 12/10',
                rating: 5,
            },
            {
                review: "Не вистачає слів, як вражає ця пам'ять. Рекомендую для професіоналів.",
                rating: 5,
            },
            {
                review: 'Дорогий, але ефективний варіант.',
                rating: 4,
            },
            {
                review: 'Завантаження програм миттєве. Ідеально для потужних робочих станцій.',
                rating: 5,
            },
        ],
    "Оперативна пам'ять Corsair DDR4-3200 32768MB PC4-25600 (Kit of 2x16384) Vengeance LPX Black (CMK32GX4M2E3200C16)":
        [
            {
                review: "Надійна і швидка пам'ять за доступною ціною.",
                rating: 4.5,
            },
            {
                review: "Corsair завжди на висоті. Пам'ять працює стабільно і надійно.",
                rating: 5,
            },
            {
                review: 'Якість Corsair на високому рівні, як завжди.',
                rating: 5,
            },
            {
                review: 'Для геймерів - ідеальний варіант. Прикро тільки, що нема RGB-підсвітки, але це дрібниці',
                rating: 4.5,
            },
        ],
    "Оперативна пам'ять Kingston Fury SODIMM DDR4-3200 16384 MB PC4-25600 Impact Black (KF432S20IB/16)":
        [
            {
                review: 'Для ноутбука - найкращий вибір. Завжди вірю Kingston.',
                rating: 5,
            },
            {
                review: "Пам'ять працює дуже ефективно. Завдяки їй ноутбук працює швидко.",
                rating: 4.5,
            },
            {
                review: 'Kingston завжди вражає якістю.',
                rating: 5,
            },
            {
                review: "Пам'ять працює без нарікань, але ціна досить висока.",
                rating: 4,
            },
        ],
    "Оперативна пам'ять Kingston Fury DDR4-3200 16384MB PC4-25600 (Kit of 2x8192)":
        [
            {
                review: 'Для середнього користувача - оптимальний вибір.',
                rating: 4.5,
            },
            {
                review: 'Через 2 місяці перестала працювати',
                rating: 1,
            },
            {
                review: "Достойна пам'ять за свої гроші.",
                rating: 5,
            },
            {
                review: 'Для щоденного використання - ідеальний варіант.',
                rating: 5,
            },
        ],
    'Монітор 24" Samsung LF24T450 Black': [
        {
            review: 'Зручний монітор для роботи в офісі.',
            rating: 4,
        },
        {
            review: 'Достатньо якісний монітор за свою ціну.',
            rating: 4.5,
        },
        {
            review: 'Samsung завжди на висоті. Рекомендую.',
            rating: 5,
        },
        {
            review: 'Недорогий монітор для дому. Зручний у використанні.',
            rating: 4,
        },
    ],
    'Монітор ASUS 24” VY249HGE (90LM06A5-B02370) IPS FHD 144Гц / 8-Bit / Adaptive Sync / Freesync Premium':
        [
            {
                review: '144Гц - це просто задоволення для геймерів. Якість зображення на висоті.',
                rating: 5,
            },
            {
                review: 'Freesync робить свою справу. Завдяки цьому монітору ігри виглядають дуже реалістично.',
                rating: 4.5,
            },
            {
                review: 'IPS матриця - великий плюс для кольорів. Монітор чудово підходить для редагування фото та відео.',
                rating: 5,
            },
            {
                review: 'Сам монітор наче і нічого, але якість ASUS вже давно мене не вражає. Переплата за бренд.',
                rating: 3.5,
            },
        ],
    'Монітор 25" ASRock CL25FF FHD IPS': [
        {
            review: 'Дуже тонкий монітор з яскравим зображенням. Цілком задоволений.',
            rating: 5,
        },
        {
            review: 'IPS дійсно робить свою справу. Кольори на моніторі виглядають яскраво і насичено.',
            rating: 5,
        },
        {
            review: 'ASRock - не тільки для материнських плат. Їхні монітори теж на висоті.',
            rating: 5,
        },
        {
            review: 'Монітор хороший, але ціна зависока.',
            rating: 4,
        },
    ],
    'Монітор 23.5" Samsung Curved LS24C366 (LS24C366EAIXCI)': [
        {
            review: 'Кривизна монітора - це щось неймовірне. Занурення в ігри на новому рівні.',
            rating: 5,
        },
        {
            review: 'Samsung завжди вражає найновітніми технологіями. Цей монітор - не виключення.',
            rating: 5,
        },
        {
            review: 'Для роботи з графікою - найкращий вибір. Колірна гамма просто чарівна.',
            rating: 5,
        },
        {
            review: "Через рік почали з'являтися засвічення по бокам. Не критично, але неприємно",
            rating: 3,
        },
    ],
    'Монітор 23.8" Acer K243YEbmix (UM.QX3EE.E01) FHD': [
        {
            review: 'Зручний офісний монітор. Недорого і якісно.',
            rating: 4,
        },
        {
            review: 'Acer - завжди гарний вибір. Надійний монітор для щоденної роботи.',
            rating: 4.5,
        },
        {
            review: 'Не розчарував. FHD роздільна здатність дозволяє насолоджуватися якістю зображення',
            rating: 5,
        },
        {
            review: 'Для офісу - нормальний вибір, але не для геймінгу.',
            rating: 4,
        },
    ],
    'Квадрокоптер DJI Mini 4 Pro with RC-N2 Remote Controller': [
        {
            review: 'Легкий та компактний квадрокоптер для початківців. Простий у використанні.',
            rating: 4.5,
        },
        {
            review: 'DJI завжди вражає якістю зйомки. Чудовий вибір для любителів фото та відео.',
            rating: 5,
        },
        {
            review: 'Простий у використанні, але дуже функціональний. Рекомендую для початківців.',
            rating: 4.5,
        },
        {
            review: 'Не зрівняти з іншими квадрокоптерами. DJI - це завжди якість',
            rating: 5,
        },
    ],
    'Квадрокоптер DJI Mavic 3 Pro Fly More Combo з пультом DJI RC Pro (CP.MA.00000662.01)':
        [
            {
                review: 'Найкращий квадрокоптер, яким я користувався. Камера просто вражає якістю зйомки.',
                rating: 5,
            },
            {
                review: 'DJI Mavic 3 Pro - це не просто квадрокоптер, а повноцінна літачна камера.',
                rating: 5,
            },
            {
                review: 'Кращий вибір для професіоналів. Якість матеріалів та функціонал - на висоті.',
                rating: 5,
            },
            {
                review: 'Дорогий, але вартий кожної гривні. Вражаюча зйомка з висоти.',
                rating: 5,
            },
        ],
    'Квадрокоптер DJI Mini 2 Fly More Combo (CP.MA.00000307.01)': [
        {
            review: 'Легкий та компактний, але з потужною камерою. Дуже задоволений покупкою.',
            rating: 5,
        },
        {
            review: 'Ідеальний варіант для початківців. Простий у використанні та надійний.',
            rating: 5,
        },
        {
            review: 'Хороший квадрокоптер за свою ціну. Відмінна якість зйомки.',
            rating: 5,
        },
        {
            review: 'Не має всіх функцій Mavic, але для своїх завдань - ідеальний.',
            rating: 4,
        },
    ],
    'Квадрокоптер Autel EVO Lite+ Premium Bundle Orange (102000720)': [
        {
            review: 'Autel завжди вражає нововведеннями. Легкий та потужний квадрокоптер.',
            rating: 5,
        },
        {
            review: 'Висока якість збірки та чудова камера. Навіть у сутінках знімає чітко.',
            rating: 4.5,
        },
        {
            review: 'Не такий відомий бренд, але квадрокоптер на високому рівні. Рекомендую.',
            rating: 5,
        },
        {
            review: 'Висока ціна, але виправдовується функціоналом.',
            rating: 4,
        },
    ],
    'Квадрокоптер DJI Matrice 30T (CP.EN.00000368.02 / 01)': [
        {
            review: 'Для професійного використання - найкращий вибір. Ідеальний для важких камер.',
            rating: 5,
        },
        {
            review: 'Коштує як машина, але свою задачу виконує на 100%',
            rating: 5,
        },
        {
            review: 'Дорогий, але ефективний для професіоналів. Вражаюча стабільність.',
            rating: 4.5,
        },
        {
            review: 'Не для початківців. Важкий та складний у керуванні.',
            rating: 4,
        },
    ],
};

export async function seed(knex: Knex): Promise<void> {
    // Deletes ALL existing entries
    await knex('product_reviews').del();

    const helper = new ProductReviewsHelper(knex);

    const insertEntries: {
        // "product_id" is a subquery
        product_id: Knex.QueryBuilder;
        user_id: number;
        review_message: string;
        star_rating: number;
        // "moderation_status_id" is a subquery
        moderation_status_id: Knex.QueryBuilder;
        created_at: Date;
    }[] = [];

    for (let [productTitle, reviews] of Object.entries(productReviews)) {
        const uniqueUsers = await helper.getUniqueUsers(reviews.length);
        reviews.forEach((review, i) => {
            insertEntries.push({
                product_id: helper.getProductIdByTitleSubquery(productTitle),
                user_id: uniqueUsers[i],
                review_message: review.review,
                star_rating: review.rating,
                moderation_status_id:
                    helper.getRandomModerationStatusIdSubquery(),
                created_at: helper.getRandomDate(),
            });
        });
    }

    // inserting reviews into the DB
    await knex('product_reviews').insert(insertEntries);
}
