import * as Yup from 'yup';

const passwordSchema = Yup.string()
    .required('Необхідно вказати пароль')
    .min(8, 'Пароль повинен мати довжину не менше 8 символів')
    .max(72, 'Пароль не повинен перевищувати 72 символи')
    .matches(/[A-Z]/, 'Пароль повинен містити принаймні 1 велику літеру')
    .matches(/[a-z]/, 'Пароль повинен містити принаймні 1 малу літеру')
    .matches(/[0-9]/, 'Пароль повинен містити принаймні 1 цифру')
    .matches(
        /[-#!$@£%^&*()_+|~=`{}\[\]:";'<>?,.\/ ]/,
        'Пароль повинен містити принаймні 1 спеціальний символ (!, @, #, тощо)'
    );

export default passwordSchema;
